/* Заголовок <ansi.h> пытается решить, достаточно ли у компилятора
 * соответствие стандарту C, которым может воспользоваться Minix. Если это так, то
 * символ _ANSI определен (как 31459). В противном случае _ANSI не определен
 * здесь, но это может быть определено приложениями, которые хотят нарушить правила.
 * Магическое число в определении должно препятствовать ненужному изгибу
 * правил. (Для соответствия новым тестам" #ifdef _ANSI " в
 * заголовки _ANSI действительно должны быть определены как ничто, но это было бы
 * разбейте многие библиотечные процедуры, использующие "#if _ANSI".)
 * Если _ANSI в конечном итоге будет определен, макрос
 *
 * _ПРОТОТИП(функция, параметры)
 *
 * определено. Этот макрос расширяется по-разному, создавая либо
 * Прототипы стандарта ANSI C или K&R в старом стиле (Kernighan & Ritchie)
 * прототипы, по мере необходимости. Наконец, некоторые программы используют _CONST, _VOIDSTAR и т. Д
 * таким образом, они переносимы как через компиляторы ANSI, так и через K&R.
 * Здесь определены соответствующие макросы.
 */

#ifndef _ANSI_H
#определи_анси_х 

#если __STDC__ == 1
#define_ANSI 		31459	/* компилятор заявляет о полном соответствии ANSI*/
#эндиф

#ifdef __GNUC__
#define_ANSI 		31459	/* gcc достаточно соответствует даже в режиме, отличном от ANSI*/
#эндиф

#define_VOIDSTAR		пустота *
#Определить_воид			пустоты

#ifdef _ANSI

/* Сохраните все для прототипов ANSI. */
#define_PROTOTYPE	(функция, параметры) параметры функции
#define_ARGS	(параметры) параметры

#define_CONST			константа
#определить_волатильную		изменчивость
#Определить_размер 		size_t

#еще

/* Отбросьте параметры для прототипов K&R. */
#define_PROTOTYPE	(функция, параметры) функция()
#define_ARGS	(параметры) ()

#Определить_конст	
#определить_волатильность	
#define _SIZET		int

#endif /* _ANSI*/

#если определено(__GNUC__) && !определено(__СТРОГИЙ_ANSI__) || __STDC_ВЕРСИЯ__ >= 199901
#определить __ДЛИННЫЙ_ДЛИННЫЙ_ПОДДЕРЖИВАЕТСЯ 1
#эндиф

/* Это должно быть определено как ограничение при использовании компилятора C99. */
#определить_район 

/* Установка любого из _MINIX, _POSIX_C_SOURCE или _POSIX2_SOURCE подразумевает
 * _POSIX_SOURCE. (Кажется неправильным помещать это здесь, в пространство ANSI.)
 */
#если определено(_MINIX) || _POSIX_C_SOURCE > 0 || определено(_POSIX2_SOURCE)
#undef _POSIX_SOURCE
#define _POSIX_SOURCE	1
#эндиф

#endif /* ANSI_H*/